Repository: briancrogers/omeka-s-cymraeg
Catalog: *.po
Languages: cy

source: Browse
cy: Pori

source: Home
cy: Hafan

source: Welcome
cy: Croeso

source: Banners of the South Wales Miners
cy: Baneri Glowyr De Cymru

source: Unfurling the Banners
cy: Agor Y Baneri

source: United We Stand
cy: Safwn Yn Ynol

source: Raise the Banners High
cy: Chwifiwn Ein Baneri

source: Professional Banner Makers
cy: Gwneuthwrwyr Baneri Proffesiynol

source: Semi Professional and Home Made Makers
cy: Gwneuthwrwyr Baneri Lled Brofesiynol a Waith Cartref

source: Banner Messages
cy: Negeseuon Baneri

source: Follow the Banner
cy: Dilyn Y Faner

source: Caring for the Banners
cy: Gofalu Am Y Baneri

source: Preserving the Banners
cy: Diogelu'r Baneri Ar Gyfer Yfory

source: Get Involved! Design your very own banner!
cy: Cymerwch Ran! Dyluniwch eich baner eich hun!

source: Powered by Omeka S
cy: Wedi'i bweru gan Omeka S
